import BRJX_AT_LIB
#创建自动化测试对象，确认硬件连接关系
newTest = BRJX_AT_LIB.AutoTest('IP3','SMW200A','FSV')

#载入测试频点
testConditions = ['50000000',
                  '100000000',
                  '250000000',
                  '400000000',
                  '550000000',
                  '700000000',
                  '850000000',
                  '1000000000']
#载入线损
signalLosses = ['-0.55541324615',
                '-0.58715075254',
                '-0.69170337915',
                '-0.80116856098',
                '-0.93753737211',
                '-0.99709540606',
                '-0.98640006781',
                '-1.01019394398']
if(newTest.linkState):
    print('连接成功开始测试')
    newTest.IP3(testConditions,signalLosses, '10000000',5)
else:
    print('仪表连接失败，请检查仪表连接情况')
